# TrussChordUntransformable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TrussFailures..::..TrussChordUntransformable Property
BuiltInFailures..::..TrussFailures Class See Also
---
Unable to maintain user changes to unpinned Chord. Restoring Truss-defined shape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TrussChordUntransformable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussChordUntransformable As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TrussChordUntransformable {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TrussFailures Class
Autodesk.Revit.DB Namespace